<?php
$mysqli= mysqli_connect("localhost","ydb" , "961016", "phptest");
if(mysqli_connect_errno()){
    printf("Connection filed:%s\n", mysqli_connect_error());
    exit();
}
else{
      $sql="insert into children(num, rice, soup, sidedish1, sidedish2, sidedish3, calorie) 
           values
           ('1','찹쌀밥','아욱된장국','쇠고기우엉볶음','오이무침','배추김치','655'),
           ('2','흑미밥','들깨미역국','돈육폭찹','명엽채조림','배추김치','704'),
           ('3','잡곡밥','소고기배추국','오징어숙회','가지무침','깍두기','631'),
           ('4','수수밥','청국장','돈안심조림','열무나물','배추김치','647'),
           ('5','찹쌀현미밥','콩가루배춧국','임연수구이','숙주미나리무침','배추김치','677'),
           ('6','차조밥','순두부찌개','달걀스크램블','연근조림','배추김치','635'),
           ('7','잡곡밥','북어국','소불고기','잔멸치볶음','배추김치','673'),
           ('8','김밥볶음밥','우동국','단호박튀김','브로콜리초무침','백김치','645'),
           ('9','찹쌀밥','수제비국','닭간장조림','멸치볶음','배추김치','697'),
           ('10','검은쌀밥','쇠고기무국','새우살애호박볶음','참나물무침','배추김치','635'),
           ('11','잡곡밥','단호박맑은국','오징어볶음','도토리묵무침','배추김치','633'),         
           ('12','차조밥','차조밥','콩비지찌개','치즈달걀말이','취나물무침','679'),
           ('13','잡곡밥','어묵쑥갓국','청경채볶음','김무침','배추김치','661'),
           ('14','수수밥','콩나물국','돈육두루치기','깻순나물무침','배추김치','635'),
           ('15','기장밥','순두부국','삼치조림','시금치나물','배추김치','680'),
           ('16','잡곡밥','미역국','돈육버섯불고기','배추된장나물','깍두기','630'),
           ('17','찹쌀현미밥','된장찌개','소불고기','상추깨소스무침','배추김치','643'),
           ('18','차조밥','미역국','돈육오징어볶음','얼갈이된장무침','배추김치','676'),
           ('19','잡곡밥','근대국','메추리알조림','청포묵무침','배추김치','637'),
           ('20','검은쌀밥','쇠고기봄동국','두부폭찹','참나물된장나물','배추김치','650'),
           ('21','기장밥','들깨무채국','돈육가지볶음','느타리버섯나물','배추김치','689'),
           ('22','잡곡밥','김국','새우살파프리카볶음','감자조림','배추김치','661'),
           ('23','잡곡밥','안매운김치국','베이컨채소볶음','미역오이무침','깍두기','617'),
           ('24','찹쌀현미밥','근대된장국','닭살감자조림','물파래초무침','배추김치','648'),
           ('25','기장밥','양배추된장국','오리부추볶음','콩나물무침','배추김치','654'),
           ('26','흑미밥','팽이버섯장국','순살후라이드치킨','양배추샐러드','배추김치','692'),
           ('27','수수밥','애호박맑은국','순살조기','잡채','배추김치','690'),
           ('28','잡곡밥','소고기무국','계란장조림','오이무침','배추김치','646'),
           ('29','검은쌀밥','동태찌개','계란채소찜','호박나물','배추김치','667'),
           ('30','기장밥','안매운육개장','찐두부','콩나물무침','볶음김치','645'),
           ('31','수수밥','소고기미역국','닭갈비','시금치나물','배추김치','633'),
            ('32','잡곡밥','시금치미역국','돈사태찜','가지나물','배추김치','618'),                  
            ('33','잡곡밥','양배추국','마파두부','연근조림','배추김치','641'),
            ('34','잡곡밥','숙주맑은국','돈육장조림','얼갈이된장나물','깍두기','655'),
            ('35','수수밥','아욱된장국','삼색달걀찜','브로콜리무침','배추김치','620'),
            ('36','흑미밥','청국장국','고등어무조림','팽이버섯나물','배추김치','599'),
            ('37','잡곡밥','맑은북엇국','닭살양배추볶음','우엉된장무침','깍두기','545'),
            ('38','찹쌀밥','근대된장국','돈육채소볶음','상추사과무침','배추김치','631'),
            ('39','잡곡밥','어묵국','두부스테이크','배무생채','배추김치','653'),
            ('40','보리밥','황태국','순살닭갈비','배추나물','깍두기','670'),
            ('41','검정콩밥','호박양파국','돈육짜장볶음','오이나물','배추김치','683'),
            ('42','렌틸콩밥','표고버섯미역국','삼치구이','브로콜리무침','깍두기','603'),
            ('43','현미밥','아욱국','새우살채소볶음','숙주나물','깍두기','621'),
            ('44','잡곡밥','버섯맑은국','우유달걀찜','비름나물','배추김치','564'),
            ('45','잡곡밥','갈비탕','콩자반','깻잎나물','배추김치','649'),
            ('46','퀴노아밥','청국장국','고등어찹쌀구이','쪽파김무침','깍두기','587'),
            ('47','수수밥','유부맑은국','수육','양배추찜(쌈장)','배추겉절이','641'),
            ('48','잡곡밥','가지된장국','소고기당근볶음','오이나물','배추김치','630'),
            ('49','현미밥','만둣국','메추리알장조림','양배추나물','깍두기','607'),
            ('50','잡곡밥','콩나물국','고등어구이','청포묵무침','배추김치','561'),
            ('51','수수밥','배추된장국','돈육간장볶음','깻잎(고춧잎)나물','깍두기','670'),
            ('52','잡곡밥','오징어국','두부스테이크','감자채볶음','배추김치','567'),
            ('53','잡곡밥','얼갈이된장국','돈육파프리카볶음','가지양파무침','깍두기','540'),
            ('54','검은콩밥','미역국','삼치조림','시금치된장무침','배추김치','556'),
            ('55','잡곡밥','참치우거지국','채소달걀말이','김구이','깍두기','625'),
            ('56','병아리콩밥','열무된장국','간장닭갈비','버섯나물','배추김치','611'),
            ('57','잡곡밥','들깨무채국','소고기숙주볶음','어린배춧잎나물','갓김치','533'),
            ('58','보리밥','애호박된장국','순살돈까스','양상추샐러드','배추김치','696'),
            ('59','잡곡밥','감자맑은국','애호박돈육찜','양배추무침','배추김치','676'),
            ('60','흑미밥','미소장국','해물완자전','브로콜리숙회','배추김치','652'),
            ('61','차조밥','시금치된장국','치즈스크램블에그','검은콩조림','배추김치','633'),
            ('62','잡곡밥','청국장국','훈제오리구이','건파래볶음','배추김치','521'),
            ('63','잡곡밥','미역국','소고기버섯불고기','시금치나물','배추김치','581'),
            ('64','기장밥','시금치된장국','가자미양념찜','쪽파나물','배추김치','559'),
            ('65','잡곡밥','달걀국','오징어채소볶음','브로콜리숙회','깍두기','617'),
            ('66','수수밥','들깨무국','간장닭갈비','열무나물','배추김치','550'),
            ('67','찹쌀밥','순두무백탕','코다리조림','애호박나물','배추김치','564'),
            ('68','흑미밥','양배추된장국','닭살흑임자무침','고구마견과류조림','배추김치','679'),
            ('69','율무밥','북엇국','돈육떡갈비','무나물','배추김치','604'),
            ('70','보리밥','청국장국','김달걀말이','미나리나물','배추김치','637')";
      
                    
    $res=mysqli_query($mysqli,$sql);
            if($res === TRUE)
            {
                echo "table insert success";

            } else{
                printf("Could not insert record:%s\n", mysqli_error($mysqli));
            }
            mysqli_close($mysqli);
}

?>

