<?php
$mysqli= mysqli_connect("localhost","ydb" , "961016", "phptest");
if(mysqli_connect_errno()){
    printf("Connection filed:%s\n", mysqli_connect_error());
    exit();
}
else{
      $sql="insert into senior(num, rice, soup, sidedish1, sidedish2, sidedish3, sidedish4) 
           values
           (1, '잡곡밥', '미역국', '꽁치조림', '연두부', '계란후라이', '배추김치'),
           (2, '잡곡밥', '된장국', '고등어구이', '연두부', '계란후라이', '배추김치'),
           (3, '잡곡밥', '김치찌개', '갈치조림', '연두부', '계란후라이','배추김치'),
           (4, '잡곡밥', '소고기무국', '깐쇼새우', '계란말이', '도토리묵무침','배추김치'),
           (5, '잡곡밥', '청국장', '돼지불고기', '계란말이', '도토리묵무침', '배추김치'),
           (6, '흰밥', '미역국', '돼지불고기', '계란말이', '도토리묵무침','배추김치'),
           (7, '흰밥', '청국장', '돼지불고기', '시금치나물', '계란후라이', '배추김치'),
           (8, '흰밥', '김치찌개', '돼지불고기', '취나물무침', '계란후라이', '배추김치'),
           (9, '흰밥', '미역국', '돼지불고기', '취나물무침', '계란후라이', '배추김치'),
           (10, '흰밥', '미역국', '제육볶음', '콩나물무침', '도토리묵무침', '배추김치'),
           (11, '흰밥', '청국장', '제육볶음', '콩나물무침', '호박전', '배추김치'),
           (12, '잡곡밥', '김치찌개', '제육볶음', '콩나물무침', '호박전', '배추김치'),
           (13, '잡곡밥', '아욱된장국', '애호박볶음', '참나물무침', '삼치구이', '배추김치'),
           (14, '검은콩밥', '계란국', '돈까스', '가지나물', '무나물', '배추김치'),
           (15, '잡곡밥', '미소장국', '마파두부', '미나리나물', '계란말이', '배추김치'),
           (16, '잡곡밥', '김치찌개', '제육볶음', '콩나물무침', '계란말이', '배추김치'),
           (17, '잡곡밥', '김치찌개', '제육볶음', '미나리나물', '계란말이', '배추김치'),
           (18, '잡곡밥', '김치찌개', '고등어구이', '미나리나물', '계란말이', '배추김치'),
           (19, '잡곡밥', '미역국', '감자전', '시금치나물', '계란말이', '배추김치'),
           (20, '잡곡밥', '소고기무국', '어묵볶음', '연두부', '참나물무침', '배추김치'),
           (21, '잡곡밥', '순두부찌개', '애호박볶음', '시금치나물', '스크램블에그', '배추김치'),
           (22, '차조밥', '된장찌개', '생선까스', '무나물', '우엉조림', '배추김치'),
           (23, '잡곡밥', '김치찌개', '연근튀김', '비름나물', '호박나물', '배추김치'),
           (24, '잡곡밥', '청국장', '해물완자전', '콩나물무침', '취나물무침', '배추김치'),
           (25, '잡곡밥', '김치찌개', '코다리조림', '가지나물', '계란말이', '배추김치'),
           (26, '김치볶음밥', '계란국', '계란후라이', '두부구이', '무나물', '배추김치'),
           (27, '잡곡밥', '김치찌개', '갈치구이', '미나리나물', '계란말이', '배추김치'),
           (28, '잡곡밥', '된장찌개', '갈치조림', '가지나물', '스크램블에그', '배추김치'),
           (29, '잡곡밥', '순두부찌개', '삼치구이', '두부부침', '미나리나물', '배추김치'),
           (30, '잡곡밥', '된장국', '고등어구이', '메추리알장조림', '콩나물무침', '배추김치'),
           (31, '차조밥', '미소된장국', '깐쇼새우', '애호박볶음', '콩나물무침', '배추김치'),
           (32, '잡곡밥', '계란국', '돼지불고기', '가지나물', '콩나물무침', '배추김치'),
           (33, '잡곡밥', '순두부찌개', '두부구이', '애호박볶음', '콩나물무침', '배추김치'),
           (34, '잡곡밥', '토란국', '고등어조림', '도토리묵무침', '콩나물무침', '배추김치'),
           (35, '잡곡밥', '미역국', '마파두부', '도토리묵무침', '미나리무침', '배추김치'),
           (36, '잡곡밥', '된장국', '고등어구이', '도토리묵무침', '가지나물', '배추김치'),
           (37, '잡곡밥', '연포탕', '잡채', '메추리알장조림', '비름나물', '배추김치'),
           (38, '잡곡밥', '된장국', '고등어구이', '메추리알장조림', '가지나물', '배추김치'),
           (39, '잡곡밥', '된장국', '쭈꾸미볶음', '메추리알장조림', '콩나물무침', '배추김치'),
           (40, '잡곡밥', '미역국', '우엉조림', '메추리알장조림', '취나물무침', '배추김치'),
           (41, '잡곡밥', '토란국', '제육볶음', '가지나물', '취나물볶음', '배추김치'),
           (42, '잡곡밥', '토란국', '코다리조림', '메추리알장조림', '가지나물', '배추김치'),
           (43, '잡곡밥', '미역국', '연근튀김', '메추리알장조림', '무나물', '배추김치'),
           (44, '잡곡밥', '된장국', '코다리조림', '두부구이', '미나리나물', '배추김치'),
           (45, '잡곡밥', '연포탕', '두부부침', '메추리알장조림', '계란말이', '배추김치'),
           (46, '검은콩밥', '부대찌개', '도토리묵무침', '비름나물', '가지나물', '배추김치'),
           (47, '잡곡밥', '김치찌개', '갈치구이', '양배추쌈', '가지나물', '배추김치'),
           (48, '잡곡밥', '청국장', '갈치조림', '시래기나물', '가지나물', '배추김치'),
           (49, '잡곡밥', '시금치된장국', '코다리조림', '감자볶음', '가지나물', '배추김치'),
           (50, '잡곡밥', '아욱된장국', '감자전', '두부부침', '가지나물', '배추김치')";
           
    $res=mysqli_query($mysqli,$sql);
            if($res === TRUE)
            {
                echo "table insert success";
            } else{
                printf("Could not insert record:%s\n", mysqli_error($mysqli));
            }
            mysqli_close($mysqli);
}
?>
